# Problem statement 5:
Perform the following operations on any open-source dataset (e.g., data.csv)
1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a dataset (age, income etc.) with numeric variables grouped by one of the qualitative (categorical) variable. For example, if your categorical variable is age groups and quantitative variable is income, then provide summary statistics of income grouped by the age groups. Create a list that contains a numeric value for each response to the categorical variable.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv("income.csv")

In [3]:
df

      Age  Gender  Education Number  Workclass  Income
0      25    Male                 7    Private  480332
1      38    Male                 9    Private  198235
2      28    Male                12  Local-gov   82785
3      44    Male                10    Private  107589
4      18  Female                10    Unknown  189322
...   ...     ...               ...        ...     ...
1994   44  Female                13    Private  270685
1995   35    Male                13    Private  186547
1996   27    Male                 9    Private  454429
1997   36    Male                13  Local-gov   95040
1998   42    Male                10  State-gov   71942

[1999 rows x 5 columns]

In [4]:
df.head()

   Age  Gender  Education Number  Workclass  Income
0   25    Male                 7    Private  480332
1   38    Male                 9    Private  198235
2   28    Male                12  Local-gov   82785
3   44    Male                10    Private  107589
4   18  Female                10    Unknown  189322

In [5]:
df.tail()

      Age  Gender  Education Number  Workclass  Income
1994   44  Female                13    Private  270685
1995   35    Male                13    Private  186547
1996   27    Male                 9    Private  454429
1997   36    Male                13  Local-gov   95040
1998   42    Male                10  State-gov   71942

In [6]:
len(df)

1999

In [7]:
df.shape

(1999, 5)

In [8]:
df.size

9995

In [9]:
df.describe()

               Age  Education Number        Income
count  1999.000000       1999.000000  1.999000e+03
mean     38.566283         10.033517  2.070535e+05
std      13.698691          2.671425  3.258124e+05
min      17.000000          1.000000  1.469100e+04
25%      27.000000          9.000000  9.745200e+04
50%      37.000000         10.000000  1.403120e+05
75%      48.000000         13.000000  2.188615e+05
max      90.000000         16.000000  1.163936e+07

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1999 entries, 0 to 1998
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Age               1999 non-null   int64
 1   Gender            1999 non-null   object
 2   Education Number  1999 non-null   int64
 3   Workclass         1999 non-null   object
 4   Income            1999 non-null   int64
dtypes: int64(3), object(2)
memory usage: 78.2+ KB

In [11]:
# Adding 'Age Group' column to DataFrame
ages = [0, 19, 32, 58, 100]
label = ["Teen", "Young", "Adult", "Old"]
df["Age Group"] = pd.cut(x=df["Age"], bins=ages, labels=label)

In [12]:
df

      Age  Gender  Education Number  Workclass  Income Age Group
0      25    Male                 7    Private  480332     Young
1      38    Male                 9    Private  198235     Adult
2      28    Male                12  Local-gov   82785     Young
3      44    Male                10    Private  107589     Adult
4      18  Female                10    Unknown  189322      Teen
...   ...     ...               ...        ...     ...       ...
1994   44  Female                13    Private  270685     Adult
1995   35    Male                13    Private  186547     Adult
1996   27    Male                 9    Private  454429     Young
1997   36    Male                13  Local-gov   95040     Adult
1998   42    Male                10  State-gov   71942     Adult

[1999 rows x 6 columns]

In [13]:
# Summary of all statistics
df.describe()

               Age  Education Number        Income
count  1999.000000       1999.000000  1.999000e+03
mean     38.566283         10.033517  2.070535e+05
std      13.698691          2.671425  3.258124e+05
min      17.000000          1.000000  1.469100e+04
25%      27.000000          9.000000  9.745200e+04
50%      37.000000         10.000000  1.403120e+05
75%      48.000000         13.000000  2.188615e+05
max      90.000000         16.000000  1.163936e+07

Columnwise Statistics

In [28]:
df["Age"].min()

17

In [29]:
df["Age"].max()

90

In [14]:
df["Age"].mean()

38.566283141570786

In [15]:
df["Age"].median()

37.0

In [16]:
df["Age"].mode()

0    41
Name: Age, dtype: int64

In [17]:
df["Age"].std()

13.698691100968377

In [19]:
df["Age"].var()

187.6541378797502

In [18]:
df["Age"].skew()

0.5215114486088329

In [30]:
df["Income"].min()

14691

In [31]:
df["Income"].max()

11639365

In [20]:
df["Income"].mean()

207053.54827413708

In [21]:
df["Income"].median()

140312.0

In [22]:
df["Income"].mode()

0      47686
1      69835
2      71260
3      72120
4      82639
5      91722
6      96612
7     111495
8     111570
9     113852
10    116360
11    120090
12    141277
13    143785
14    166080
Name: Income, dtype: int64

In [23]:
df["Income"].std()

325812.3596237139

In [24]:
df["Income"].var()

106153693683.57227

In [32]:
df["Income"].skew()

22.609157935060583

Grouping Statistical Analysis

In [27]:
pd.set_option("display.max_columns", None)
df.groupby("Age Group").describe()

              Age                                                     \
            count       mean       std   min   25%   50%   75%   max
Age Group
Teen         97.0  18.309278  0.712402  17.0  18.0  18.0  19.0  19.0
Young       647.0  25.802164  3.801718  20.0  23.0  26.0  29.0  32.0
Adult      1075.0  43.539535  7.219559  33.0  37.0  43.0  49.0  58.0
Old         180.0  65.661111  5.604431  59.0  62.0  64.5  68.0  90.0

          Education Number                                                   \
                     count       mean       std  min  25%   50%   75%   max
Age Group
Teen                  97.0   8.350515  1.768010  1.0  7.0   9.0  10.0  10.0
Young                647.0  10.106646  2.239403  1.0  9.0  10.0  12.0  16.0
Adult               1075.0  10.306977  2.780401  1.0  9.0  10.0  13.0  16.0
Old                  180.0   9.044444  3.242218  1.0  7.0   9.0  10.0  16.0

           Income                                                             \
            count           mean            std      min       25%       50%
Age Group
Teen         97.0  190570.907216  199892.534420  30294.0  117904.0  142964.0
Young       647.0  214120.863988  491161.323691  23855.0   95545.5  137568.0
Adult      1075.0  206520.119070  204964.013568  14691.0   97614.5  141374.0
Old         180.0  193718.544444  200676.733315  29174.0  101689.0  140146.0


                75%         max
Age Group
Teen       189322.0   1796730.0
Young      218400.0  11639365.0
Adult      227188.0   1728465.0
Old        198923.0   1935306.0

In [45]:
df.groupby("Age Group")["Age"].min()

Age Group
Teen     17
Young    20
Adult    33
Old      59
Name: Age, dtype: int64

In [46]:
df.groupby("Age Group")["Age"].max()

Age Group
Teen     19
Young    32
Adult    58
Old      90
Name: Age, dtype: int64

In [47]:
df.groupby("Age Group")["Age"].mean()

Age Group
Teen     18.309278
Young    25.802164
Adult    43.539535
Old      65.661111
Name: Age, dtype: float64

In [48]:
df.groupby("Age Group")["Age"].median()

Age Group
Teen     18.0
Young    26.0
Adult    43.0
Old      64.5
Name: Age, dtype: float64

In [44]:
df.groupby("Age Group")["Age"].aggregate(pd.Series.mode)

Age Group
Teen     19
Young    20
Adult    41
Old      62
Name: Age, dtype: int64

In [49]:
df.groupby("Age Group")["Age"].std()

Age Group
Teen     0.712402
Young    3.801718
Adult    7.219559
Old      5.604431
Name: Age, dtype: float64

In [50]:
df.groupby("Age Group")["Income"].var()

Age Group
Teen     3.995703e+10
Young    2.412394e+11
Adult    4.201025e+10
Old      4.027115e+10
Name: Income, dtype: float64

In [34]:
df.groupby("Age Group")["Income"].min()

Age Group
Teen     30294
Young    23855
Adult    14691
Old      29174
Name: Income, dtype: int64

In [35]:
df.groupby("Age Group")["Income"].max()

Age Group
Teen      1796730
Young    11639365
Adult     1728465
Old       1935306
Name: Income, dtype: int64

In [36]:
df.groupby("Age Group")["Income"].mean()

Age Group
Teen     190570.907216
Young    214120.863988
Adult    206520.119070
Old      193718.544444
Name: Income, dtype: float64

In [37]:
df.groupby("Age Group")["Income"].median()

Age Group
Teen     142964.0
Young    137568.0
Adult    141374.0
Old      140146.0
Name: Income, dtype: float64

In [51]:
df.groupby("Age Group")["Income"].std()

Age Group
Teen     199892.534420
Young    491161.323691
Adult    204964.013568
Old      200676.733315
Name: Income, dtype: float64

In [52]:
df.groupby("Age Group")["Income"].var()

Age Group
Teen     3.995703e+10
Young    2.412394e+11
Adult    4.201025e+10
Old      4.027115e+10
Name: Income, dtype: float64

In [53]:
df.groupby("Education Number")["Income"].min()

Education Number
1     116219
2      46188
3      46709
4      40649
5      31345
6      30294
7      34935
8      39732
9      20688
10     23253
11     28275
12     25481
13     23973
14     14691
15     41138
16     30292
Name: Income, dtype: int64

In [54]:
df.groupby("Education Number")["Income"].max()

Education Number
1       296776
2       660738
3       820441
4      1107119
5      1935306
6      1114504
7      1796730
8       700542
9     11639365
10     1724760
11     1046834
12     1728465
13     1606308
14      808197
15      447170
16      741308
Name: Income, dtype: int64

In [55]:
df.groupby("Education Number")["Income"].mean()

Education Number
1     188628.666667
2     263830.400000
3     176817.280000
4     183855.355556
5     305868.515152
6     179390.090909
7     189406.441860
8     238758.187500
9     225586.230769
10    205112.707483
11    214950.644737
12    209369.357143
13    195278.107558
14    176751.135135
15    139989.800000
16    176696.760000
Name: Income, dtype: float64

In [56]:
df.groupby("Education Number")["Income"].median()

Education Number
1     158058.0
2     169370.5
3     116805.0
4     148414.0
5     177820.0
6     135097.5
7     126378.0
8     147662.0
9     143856.0
10    140073.0
11    147732.5
12    140916.0
13    138813.5
14    132645.0
15    111338.0
16    134277.0
Name: Income, dtype: float64

In [59]:
df.groupby("Education Number")["Income"].std()

Education Number
1      75684.727465
2     220221.818178
3     179403.051466
4     176965.567863
5     400252.145770
6     156333.829056
7     221102.385490
8     201138.264799
9     502911.570408
10    208342.867785
11    181976.203395
12    252642.788225
13    180785.269142
14    144881.614729
15     89488.182246
16    144377.157530
Name: Income, dtype: float64

In [60]:
df.groupby("Education Number")["Income"].var()

Education Number
1     5.728178e+09
2     4.849765e+10
3     3.218545e+10
4     3.131681e+10
5     1.602018e+11
6     2.444027e+10
7     4.888626e+10
8     4.045660e+10
9     2.529200e+11
10    4.340675e+10
11    3.311534e+10
12    6.382838e+10
13    3.268331e+10
14    2.099068e+10
15    8.008135e+09
16    2.084476e+10
Name: Income, dtype: float64